/*
*方法描述：
* @param number,array,object,string
* @return number
*
* 传入一个数值类型的参数，返回该值的符号类型,
* 分别用1, -1, 0, NaN表示，正数、负数、零、非数值。
* 如果传入的是一个字符串类型的数值，那么应该返回该数值的符号。
* Example
* sign(3)     //  1
* sign(-3)    // -1
* sign("-3")  // -1
* sign(0)     //  0
* sign(NaN)   // NaN
* sign("foo") // NaN
* sign()      // NaN
*
* 单一元素数组
* 说明：单个元素的数组可以被强制转换成数值或字符串
* 2*[5]   // -> 10
* 2*['5'] // -> 10
* 10-[5]  // ->  5
* 10+[5]  // -> 105 !!
*
* sign函数应该像javascript一样处理单一元素数组，如果它是确实是一个数值
* sign([42])  // ->  1
* sign([-42]) // -> -1
* sign([0])   // ->  0
* sign([4,2]) // -> NaN (只有一个元素的数字才进行强制转换)
* //...and...
* sign(['42'])  // ->  1
* sign(['-42']) // -> -1
* sign(['0'])   // ->  0
* sign(['4','2']) // -> NaN
*
*
*
*
*/
function sign(number){

}